wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
                          #ifdef USES_DISPLAY
                              if (m == 0) {
                                  FW_Common::OLED.TopPanelUpdate("Play Timer: OFF");
                              } else {
                                  char buf[24];
                                  snprintf(buf, sizeof(buf), "Play Timer: %2u min", (unsigned)m);
                                  FW_Common::OLED.TopPanelUpdate(buf);
                              }
                              delay(800);
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_PlayTimer);
                          #endif // USES_DISPLAY
                        }
                        break;
                        case FW_Const::PauseMode_AnalogInvertX:
                        {
                          // Toggle X 轴反转
                          uint32_t v = OF_Prefs::settings[OF_Const::analogInvertX];
                          v = v ? 0 : 1;
                          OF_Prefs::settings[OF_Const::analogInvertX] = v;
                          OF_Prefs::SaveSettings();

                          if (!OF_Serial::serialMode) {
                              Serial.print("Analog X axis invert: ");
                              Serial.println(v ? "ON" : "OFF");
                          }
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.TopPanelUpdate(v ? "X Axis: Inverted" : "X Axis: Normal");
                              delay(800);
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogInvertX);
                          #endif
                        }
                        break;
                        case FW_Const::PauseMode_AnalogInvertY:
                        {
                          // Toggle Y 轴反转
                          uint32_t v = OF_Prefs::settings[OF_Const::analogInvertY];
                          v = v ? 0 : 1;
                          OF_Prefs::settings[OF_Const::analogInvertY] = v;
                          OF_Prefs::SaveSettings();

                          if (!OF_Serial::serialMode) {
                              Serial.print("Analog Y axis invert: ");
                              Serial.println(v ? "ON" : "OFF");
                          }
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.TopPanelUpdate(v ? "Y Axis: Inverted" : "Y Axis: Normal");
                              delay(800);
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogInvertY);
                          #endif
                        }
                        break;
                        case FW_Const::PauseMode_EscapeSignal:
                          SendEscapeKey();

                          #ifdef USES_DISPLAY
                              FW_Common::OLED.TopPanelUpdate("Sent Escape Key!");
                          #endif // USES_DISPLAY

                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 3; ++i) {
                                  OF_RGB::LedUpdate(150,0,150);
                                  delay(55);
                                  OF_RGB::LedOff();
                                  delay(40);
                              }
                          #endif // LED_ENABLE

                          #ifdef USES_DISPLAY
                              FW_Common::OLED.TopPanelUpdate("Using ", OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                          #endif // USES_DISPLAY
                          break;
                        /*case FW_Const::PauseMode_Exit:
                          Serial.println("Exiting pause mode...");
                          if(FW_Common::runMode == FW_Const::RunMode_Processing) {
                              switch(OF_Prefs::profiles[OF_Prefs::currentProfile].FW_Common::runMode) {
                                  case FW_Const::RunMode_Normal:
                                    FW_Common::SetFW_Const::RunMode(FW_Const::RunMode_Normal);
                                    break;
                                  case FW_Const::RunMode_Average:
                                    FW_Common::SetFW_Const::RunMode(FW_Const::RunMode_Average);
                                    break;
                                  case FW_Const::RunMode_Average2:
                                    FW_Common::SetFW_Const::RunMode(FW_Const::RunMode_Average2);
                                    break;
                                  default:
                                    break;
                              }
                          }
                          FW_Common::SetMode(FW_Const::GunMode_Run);
                          break;
                        */
                        default:
                          Serial.println("Oops, somethnig went wrong.");
                          break;
                    }
                } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                    if(!OF_Serial::serialMode)
                        Serial.println("Exiting pause mode...");

                    // 离开暂停菜单时重置并启动计时（若设置了非 0 分钟）
                    PlayTimer::ResetAndStart();

                    FW_Common::SetMode(FW_Const::GunMode_Run);
                }

                if(pauseExitHoldStarted && FW_Common::buttons.debounced & FW_Const::ExitPauseModeHoldBtnMask) {
                    unsigned long t = millis();
                    if(t - pauseHoldStartstamp > (OF_Prefs::settings[OF_Const::holdToPauseLength] / 2)) {
                        if(!OF_Serial::serialMode)
                            Serial.println("Exiting pause mode via hold...");

                        if(FW_Common::runMode == FW_Const::RunMode_Processing) {
                            switch(OF_Prefs::profiles[OF_Prefs::currentProfile].runMode) {
                                case FW_Const::RunMode_Normal:
                                  FW_Common::SetRunMode(FW_Const::RunMode_Normal);
                                  break;
                                case FW_Const::RunMode_Average:
                                  FW_Common::SetRunMode(FW_Const::RunMode_Average);
                                  break;
                                case FW_Const::RunMode_Average2:
                                  FW_Common::SetRunMode(FW_Const::RunMode_Average2);
                                  break;
                                default:
                                  break;
                            }
                        }

                        #ifdef USES_RUMBLE
                            if(OF_Prefs::toggles[OF_Const::rumble]) for(uint i = 0; i < 3; ++i) {
                                analogWrite(OF_Prefs::pins[OF_Const::rumblePin], OF_Prefs::settings[OF_Const::rumbleStrength]);
                                delay(80);
                                #ifdef ARDUINO_ARCH_ESP32
                                    analogWrite(OF_Prefs::pins[OF_Const::rumblePin], 0);  // 696969 per ESP32
                                #else // rp2040
                                digitalWrite(OF_Prefs::pins[OF_Const::rumblePin], LOW);
                                #endif
                                delay(50);
                            }
                        #endif // USES_RUMBLE

                        // 长按退出暂停时同样启动计时
                        PlayTimer::ResetAndStart();

