wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
    FW_Common::SetMode(newMode);
}

// Handles events when trigger is pulled/held
void TriggerFire()
{
    // 计时结束后完全禁用所有按键输出（包括鼠标/键盘/手柄）
    if (PlayTimer::AreInputsLocked()) {
        return;
    }
    if(!FW_Common::buttons.offScreen) {
        if(!OF_FFB::triggerHeld) {
            if(FW_Common::buttons.analogOutput) // this should only ever be gamepad outputs
                Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
            else switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                default: break;
            }
        }

        if(!OF_Serial::serialMode && 
           !bitRead(FW_Common::buttons.debounced, FW_Const::BtnIdx_Start) &&
           !bitRead(FW_Common::buttons.debounced, FW_Const::BtnIdx_Select))
            OF_FFB::FFBOnScreen();
    // We're shooting outside of the screen boundaries!
    } else {  
        // If we are in offscreen button mode (and aren't dragging a shot offscreen)
        if(!OF_FFB::triggerHeld) {
            if(FW_Common::buttons.analogOutput) // always uses the same button
                Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
            else switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType2) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.press(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                default: break;
            }

            FW_Common::triggerPressedOffscreen = true;
        }

        if(!OF_Serial::serialMode) OF_FFB::FFBOffScreen();
    }
    OF_FFB::triggerHeld = true;
}

// Handles events when trigger is released
void TriggerNotFire()
{
    if(OF_FFB::triggerHeld) {
        if(FW_Common::buttons.analogOutput)
            Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode3);
        else if(FW_Common::triggerPressedOffscreen) {
            switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType2) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode2); break;
                default: break;
            }
            FW_Common::triggerPressedOffscreen = false;
        } else {
            switch(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportType) {
                case LightgunButtons::ReportType_Mouse:   AbsMouse5.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Keyboard: Keyboard.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                case LightgunButtons::ReportType_Gamepad: Gamepad16.release(LightgunButtons::ButtonDesc[FW_Const::BtnIdx_Trigger].reportCode); break;
                default: break;
            }
        }
    }

    OF_FFB::triggerHeld = false;

    if(!OF_Serial::serialMode) OF_FFB::FFBRelease();
}

#ifdef USES_ANALOG
void AnalogStickPoll()
{
    int analogValueX = analogRead(OF_Prefs::pins[OF_Const::analogX]);
    int analogValueY = analogRead(OF_Prefs::pins[OF_Const::analogY]);
    
    if(OF_Prefs::settings[OF_Const::analogMode] == OF_Const::analogModeStick) {
        auto scale_with_cal = [](int32_t v, uint32_t minU, uint32_t maxU) -> int32_t {
            const int32_t minV = (int32_t)minU;
            const int32_t maxV = (int32_t)maxU;
            if (maxV <= minV) return v;
            if (v <= minV) return ANALOG_STICK_MIN_X;
            if (v >= maxV) return ANALOG_STICK_MAX_X;
            const int64_t inSpan = (int64_t)(maxV - minV);
            const int64_t outSpan = (int64_t)(ANALOG_STICK_MAX_X - ANALOG_STICK_MIN_X);
            const int64_t num = ((int64_t)(v - minV) * outSpan) + (inSpan / 2); // 四舍五入
            return (int32_t)(ANALOG_STICK_MIN_X + (num / inSpan));
        };

        // -------- 可配置死区（0–30%）：以中心为基准 --------
        // 读取百分比（由暂停菜单写入），限制在 0–30 之间
        uint32_t dzPercent = 0;
        if (OF_Const::settingsTypesCount > OF_Const::analogDeadzone) {
            dzPercent = OF_Prefs::settings[OF_Const::analogDeadzone];
        }
        if (dzPercent > 30) dzPercent = 30;

        // 轻量滤波（IIR），抑制 ADC 抖动导致的“跳动”
        // 只影响 analogX/analogY（左摇杆），不影响摄像头/IR 映射
        static int32_t filtX = ANALOG_STICK_CENTER_X;
        static int32_t filtY = ANALOG_STICK_CENTER_Y;
        if (FW_Common::analogCenterJustCalibrated) {
            filtX = analogValueX;
            filtY = analogValueY;
            FW_Common::analogCenterJustCalibrated = false;
        } else {
            // alpha = 1/5 ≈ 0.2
            filtX = (filtX * 4 + analogValueX) / 5;
            filtY = (filtY * 4 + analogValueY) / 5;
        }

        // 直接把存储的 uint32_t 按 int32_t 语义解释为偏移
        int32_t offsetX = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetX];
        int32_t offsetY = (int32_t)OF_Prefs::settings[OF_Const::analogCenterOffsetY];

